# Start Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCRange..::..Start Property
IFCRange Class See Also
---
The starting value of the range.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Start { get; set; }
```

Visual Basic
---
```text
Public Property Start As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Start {
	double get ();
	void set (double value);
}
```

# See Also
IFCRange Class
Autodesk.Revit.DB.IFC Namespace